{"backend": "tensorflow", "config": {"layers": [{"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "data_format": "channels_last", "batch_input_shape": [null, 28, 28], "dtype": "float32"}}, {"class_name": "Dense", "config": {"units": 512, "trainable": true, "use_bias": true, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout", "seed": null, "noise_shape": null, "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"units": 10, "trainable": true, "use_bias": true, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "dtype": "float32"}}], "name": "sequential"}, "class_name": "Sequential", "keras_version": "2.2.4-tf"}